import 'dart:ui';

class CommonConstant {
  static const Color backgroundColor = Color.fromRGBO(240, 242, 246, 1);
}

///测点类型(传感器类型)
Map<int, String> sensorMap = {
  1000: '静力水准',
  1001: '单通道振弦',
  1003: '温度计',
  1004: '静压水准',
  1005: '位移计',
  1006: '状态传感器',
  1010: '单轴倾角',
  1011: '单轴测斜',
  1012: '单轴水平尺',
  1013: '激光测距仪',
  1014: '水位计',
  1015: '压力传感器',
  2010: '双轴倾角',
  2021: '双轴测斜',
  3005: '三向位移计',
  4001: '四通道振弦',
  5016: '五要素气象仪',
  8001: '八通道振弦',
};
Map<String, int> sensorMapF = {
  '静力水准': 1000,
  '单通道振弦': 1001,
  '温度计': 1003,
  '静压水准': 1004,
  '位移计': 1005,
  '状态传感器': 1006,
  '单轴倾角': 1010,
  '单轴测斜': 1011,
  '单轴水平尺': 1012,
  '激光测距仪': 1013,
  '水位计': 1014,
  '压力传感器': 1015,
  '双轴倾角': 2010,
  '双轴测斜': 2021,
  '三向位移计': 3005,
  '四通道振弦': 4001,
  '五要素气象仪': 5016,
  '八通道振弦': 8001,
};

///测项类型
Map<int, String> eventType = {
  1: '其它',
  2: '沉降',
  3: '水位',
  4: '固定测斜',
  5: '倾角',
  6: '振弦',
  7: '收敛',
  8: '自动测斜',
  9: '滑动测斜',
  10: '支撑轴力'
};
Map<String, int> eventTypeF = {
  '其它': 1,
  '沉降': 2,
  '水位': 3,
  '固定测斜': 4,
  '倾角': 5,
  '振弦': 6,
  '收敛': 7,
  '自动测斜': 8,
  '滑动测斜': 9,
  '	支撑轴力': 10,
};

Map<int, int> timeMap = {
  0: 5,
  1: 10,
  2: 30,
  3: 60,
  4: 120,
  5: 180,
  6: 360,
  7: 720,
  8: 1440,
};

///单位
Map<int, String> paramsEx = {
  1: 'mm',
  2: 'cm',
  3: 'm',
  4: '°',
  5: '´',
  6: '˝',
  7: 'Hz',
  8: 'mA',
  9: 'A',
  10: 'mV',
  11: 'V',
  12: '℃',
  13: 'με',
  14: 'ε',
  15: 'KPa',
  16: 'Pa',
  17: 'KN',
  18: '%RH',
  19: 'm/s',
};
Map<String, int> paramsExF = {
  'mm': 1,
  'cm': 2,
  'm': 3,
  '°': 4,
  '´': 5,
  '˝': 6,
  'Hz': 7,
  'mA': 8,
  'A': 9,
  'mV': 10,
  'V': 11,
  '℃': 12,
  'με': 13,
  'ε': 14,
  'KPa': 15,
  'Pa': 16,
  'KN': 17,
  '%RH': 18,
  'm/s': 19,
};

///协议类型
Map<int, String> protocolType = {
  1: '华桓传感器',
  2: 'TCP采集仪',
  3: 'MQTT节点——单传感器',
  4: '透传模块',
  5: 'MQTT节点——多传感器',
};
Map<String, int> protocolTypeF = {
  '华桓传感器': 1,
  'TCP采集仪': 2,
  'MQTT节点——单传感器': 3,
  '透传模块': 4,
  'MQTT节点——多传感器': 5,
};

///采集仪类型
Map<int, String> collectorType = {
  1: 'HD-CJY2021-电池版',
  2: 'HD-CJY2021-电源版',
  3: 'TCP透穿设备',
  4: '全自动测斜设备',
  5: '人工测斜设备',
  6: 'HD-WX4G-NODE',
  7: 'HD-QJ090-2井盖传感器',
  8: '带屏采集仪',
  9: 'HD-NODE-MB4',
  10: '8通道无限振弦采集仪',
};
Map<String, int> collectorTypeF = {
  'HD-CJY2021-电池版': 1,
  'HD-CJY2021-电源版': 2,
  'TCP透穿设备': 3,
  '全自动测斜设备': 4,
  '人工测斜设备': 5,
  'HD-WX4G-NODE': 6,
  'HD-QJ090-2井盖传感器': 7,
  '带屏采集仪': 8,
  'HD-NODE-MB4': 9,
  '8通道无限振弦采集仪': 10,
};
